# คำสั่งแสดงผลข้อมูลที่แตกต่างใน [print]()เดียว
# มีให้เลือกใช้ 4 วิธี
# ใช้ , โดยทุกๆ comma จะมีเว้นวรรค 1 ช่องว่าง (1 spece)
print('สวัสดี',555,'Wow wow wow',True,999,'Hi...',10+20)

# ใช้ + แต่มีข้อแม้ คือ ข้อมูลใดที่ไม่ใช่ String ต้องแปลงให้เป็น string
# คำสั่งที่ใช่แปลง string คือ str(????)แล้วก็ไม่มีเว้นวรรคให้เหมือน ,
print('สวัสดี ' +str(555)+ ' Wow wow wow ' +str(True)+str(999)+ ' Hi...'+str(10+20))
print('สวัสดี    '+str(555)+' Wow wow wow '+str(True)+' ''Hi...'+str(10+20))

# ใช้ เมธอด format( )แต่มีข้อมูล คือ ข้อมูลใดที่ไม่ใช่ string ให้เอาไปใส่ในวงเล็บของ format ()
# และตำแหน่งที่จะแสดงข้อมูลนั้นให้เป็น {}
print('สวัสดี {} Wow wow wow {} {}  Hi...{}'.format(555, True, 999, 10+20) )
print('XXXXX{2} YYYYY {3}'.format(555, True, 999, 10+20))

# ใช้ f-string ต้องมีตัว fอยู่ข้างหน้า และตรงไหนที่ไม่ใช่ string ให้เขียนใน {????}
print(f'สวัสดี {555} Wow wow wow {True}{999}Hi... {10+20}')
