# ทำโปรแกรมคิด commission สำหรับพนักงานขาย โดยให้ป้อนชื่อพนักงาน และยอดขายทางแป้นพิมพ์
# และแสดงผลข้อมูลที่ป้อนและคำนวณได้ทางหน้าจอ โดย ค่า commission คิดจากยอดขาย
# - ยอดขายไม่เกิน 100000 คิดค่า 10% ของยอดขาย
# - เมื่อยอดขายมากกว่า 100000 

print('-----------------------------')
print('  โปรแกรมคิดค่า commission')
print('-----------------------------')
emp_name = input('ป้อนชื่อพนักงาน :')
emp_sale = float(input('ป่อนยอดขาย :'))
print('-----------------------------')
if emp_sale <=100000 :
    commision = emp_sale * 10 / 100
else :
    commision = emp_sale * 15 / 100

print(f'คุณ{emp_name} ยอดขาย {emp_sale} บาท ได้รับค่า commission เป็น {commision:,.2f} บาท')
print('----------------------------------------------------------------------')