# ทำโปรแกรมสอบถามข้อมูลสายรถเมล์ โดยให้ป้อนสายรถเมล์ที่ต้องการ และแสดงผลข้อมูลว่าไปไหน
# 84
# 81




print('----------------------------')
print('โปรแกรมสอบถามข้อมูลสายรถเมล์')
print('----------------------------')
bus_number = input('ป้อนสายรถเมล์')
print('----------------------------')
if bus_number == '84' :
    print('อ้อมน้อย  วัดไร่ขิง....')
elif bus_number == '81' :
    print('พรานนก  ศิริราช....')
elif bus_number == '80' :
    print('สนามหลวง  บางขุนนท์  ปิ่นเกล้า....')
elif bus_number == '8' :
    print('สะพานพุทธ  เดอะมอล์บางกะปิ....')
elif bus_number == '7' :
    print('คลองเตย  พระประแดง....')
elif bus_number == '1' :
    print('ถนนตก ท่าเตียน')
elif bus_number == '35' :
    print('พระประแดง ปิ่นเกล้า')
else :
    print('ไม่มีข้อมูลสายรถเมล์นี้')