# สร้างโปรแกรมคำนวณสีที่ต้องใช้ว่าต้องใช้กี่แกลอนในการทาผนังของห้อง
# เพดาลของห้องสี่เหลี่ยมโดยให้รับความกว้าง ความยาว ความสูงของห้อง (หน่วยเป็นเมตร)ทางแป้นพิมพ์
# แล้วแสดงผลพื้นที่ที่ต้องทา และจำนวณแกลอนที่คำนวณได้ออกมา โดยสี 1 แกลอนทาได 1.25 ตารางเมตร

print('+++++++++++++++++++++++')
print('โปรแกรม คำนวณสีทาผนัง')
print('+++++++++++++++++++++++')
wi = float(input('ป้อนกว้าง: '))
low = float(input('ป้อนยาว: '))
hi = float(input('ป้อนสูง: '))
print('+++++++++++++++++++++++')
area = (wi * hi * 2) + (low * hi * 2 ) + (wi * low)
gallon = area / 1.25
print(f'ห้องพื้นที่: {(area):.4f} ตร.ม. ใช้สี {gallon} แกลอน' )
print('----------------------------')
print('ห้องพื้นที่' ,area, 'ตร.ม. ใช้สี' ,gallon,'แกลอน' )
print('----------------------------')
print('ห้องพื้นที่ ' +str(area)+' ตร.ม. ใช้สี ' +str(gallon)+' แกลอน' )
print('----------------------------')
print('ห้องพื้นที่ {0} ตร.ม. ใช้สี {1} แกลอน ' .format(area,gallon))
