# คำสั่งรับค่าข้อความจากแป้นพิมผู้ใช้งาน
# ตัวแปร varibleble คือ ชื่อที่ dev. ตั้งขึ้นเองเอาไว้เก็บข้อมูลในโปรแกรม
fullname = input('ป้อนชื่อ : ')
yearborn = input('ป้อนปีเกิด : ')
salary = input('ป้อนปีเงินเดือน : ')
input('--------------------------------------------------')
print(f'ยินดีต้อนรับคุณ {fullname}')
input(f'คุณเกิดปี พ.ศ. {yearborn}')
input(f'ตอนนี้คุณอายุ {2568 - int(yearborn)}')
input(f'คุณได้รับเงินเดือน {salary} บาท')
input(f'คุณเสียภาษี {(float(salary) * 7 /100):.4f} บาท')
input(f'คุณเสียภาษี {(float(salary) * 7 /100):,.9f} บาท')