# control Flow - control statement
# ในทางโปรแกรมคอมพิวเตอร์ ผล -> พิสูจน์ / ตรวจสอบ ตัดสินใจ -> true/false 
# selection/condition สำหรับโพเซสการทำงานที่ต้องมีการพิสูจน์/ตรวจสอบ/ตัดสินใจก่อนที่จะทำงานใดๆ
# 1.พิสูจน์ครั้งเดียว จริงทำ เท็จไม่ทำ if

# 2.พิสูจน์ครั้งเดียว เท็จทำอีกอย่าง จริงทำอีกอย่าง if - else

# 3.พิสูจน์หลายครั้ง ใช้คำสั่ง if-else-if  



# Loop/Repeat/ iteration สำหรับโพรเซสการทำงานเดิมๆ ซ้ำ
# การทำงานเดิมๆ ซ้ำแต่ละครั้ง ข้อมูลที่เอามาทำซ้ำไม่จำเป็นต้องเหมือนกัน และผลลัพธ์ที่ได้แต่ละครั้งก็ไม่จำเป็นต้องเหมือนกัน
# มีแบบรู้จำนวนครั้งในการทำงานซ้ำ

# กับแบบไม่รู้จำนวนครั้งในการทำงานซ้ำ (แต่ต้องรู้จบ)  
# while, for