# การแปลงข้อมูล
# Fundamental
# แปลงข้อมูลใดๆเป็น string ใฃ้ฟังต์ชั่น str( )
# แปลงข้อมูล string เป็น number
# -> เลขจำนวนเต็มใช้ฟังชั่น int()
# ->เลขจำนวนทศนิยมใช้ฟังชั่น float()
# *****************************
# print()แสดงผลข้อมูล
# input()รับข้อมูลที่เป็น string เท่านั้น
# ******************************
# สร้างโปรแกรมคำนวนเงินเดินสุทธิที่ต้องจ่ายหลังจากหักภาษีแล้ว 7% และหักค่าประกันสังคม 3%ของเงินเดือน
# โดยรับค่ารหัสพนักงาน เงินเดือน ทางแป้นพินพ์ และแสดงผลข้อมูลที่รับมา
# พร้อมกับรายละเอียดว่าต้องเสียภาษีกี่บาท หักค่าประกันสังคมกี่บาท และต้องจ่ายเงินสุทธิกี่บาท

print('----------------------------')
print('---โปรแกรมคำนวณเงินเดือนสุทธิ---')
print('----------------------------')
emp_id = input('ป้อนรหัสพนักงาน :')
emp_name = input('ป้อนชื่อพนักงาน :')
emp_salary = float(input('ป้อนเงินเดือน :'))
print('-----------------------------')
emp_tax = (emp_salary)*7 / 100
emp_insur = (emp_salary)*3 / 100
emp_salary_total = emp_salary-emp_tax-emp_insur
print(f'รหัสพนักงาน : {emp_id} คุณ {emp_name}')
print(f'เงินเดือนก่อนหักค่าใช้จ่าย : {emp_salary}บาท')
print(f'เงินเดือนหลังหักภาษี 7% : {emp_tax:,.2f}บาท')
print(f'เงินเดือนหลังภาษี 3% : {emp_insur}บาท')
print(f'เงินเดือนสุทธิที่ได้รับ  : {emp_salary_total}บาท')
print('---------------------------------------------')
# ใช้เมธอด format
print('รหัสพนักงาน : {} คุณ {}' .format(emp_id,emp_name))
print('เงินเดือนก่อนหักค่าใช้จ่าย :{}: บาท'.format(emp_salary))
print('เงินเดือนหลังหักภาษี 7% : {:,.2f}บาท'.format(emp_tax))
print('เงินเดือนหลังภาษี 3% : {}บาท'.format(emp_insur))
print('เงินเดือนสุทธิที่ได้รับ : {}บาท'.format(emp_salary_total))
# ใช้เมธอด ,
print('-----------------------------------------------')
print('รหัสพนักงาน :' ,emp_id, 'คุณ' ,emp_name, )
print('เงินเดือนก่อนหักค่าใช้จ่าย :' ,emp_salary,'บาท')
print('เงินเดือนหลังหักภาษี 7% :' ,emp_tax,'บาท')
print('เงินเดือนหลังภาษี 3% :' ,emp_insur, 'บาท')
print('เงินเดือนสุทธิที่ได้รับ :' ,emp_salary_total, 'บาท')
# ใช้เมธอด + 
print('----------------------------------------------')
print('รหัสพนักงาน :' +str(emp_id)+ 'คุณ' +str(emp_name, ))
print('เงินเดือนก่อนหักค่าใช้จ่าย :' +str(emp_salary)+'บาท')
print('เงินเดือนหลังหักภาษี 7% :' +str(emp_tax)+'บาท')
print('เงินเดือนหลังภาษี 3% :' +str(emp_insur)+ 'บาท')
print('เงินเดือนสุทธิที่ได้รับ :' +str(emp_salary_total)+ 'บาท')

